package lesson1;
/*
Реализуйте метод, принимающий в качестве аргумента целочисленный массив и некоторое значение.
Метод ищет в массиве заданное значение и возвращает его индекс. При этом, например:
 - если длина массива меньше некоторого заданного минимума, метод возвращает -1, в качестве кода ошибки.
 - если искомый элемент не найден, метод вернет -2 в качестве кода ошибки.
 - если вместо массива пришел null, метод вернет -3
 - придумайте свои варианты исключительных ситуаций и верните соответствующие коды ошибок.
 Напишите метод, в котором реализуйте взаимодействие с пользователем.
 То есть, этот метод запросит искомое число у пользователя, вызовет первый,
 обработает возвращенное значение и покажет читаемый результат пользователю.
 Например, если вернулся -2, пользователю выведется сообщение: “Искомый элемент не найден”.
*/
public class Task01 {
    public static final int MIN_LENGTH = 3;

    public static void main(String[] args) {

        int[] array = {1, 3, 4, 4, 5, 6};
        System.out.println(findElement(array, 2));

    }
    public static int findElement(int[] array, int num){
        if(array == null){
            return -3;
        }
        if(array.length > MIN_LENGTH){
            for (int i = 0; i < array.length; i++) {
                if(array[i] == num){
                    return i;
                }
            }
            return -2;
        }
        return -1;
        }


    }

